# SQL Query on DataFrame

#### How to query IRIS Dataset using SQL Query?

* Pandas Built-In methods
* pandasql module
* duckdb module

### Import some libs

In [1]:
# install some modules and packages
!pip install pandasql
!pip install duckdb

Requirement already satisfied: pandasql in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (0.7.3)
Requirement already satisfied: numpy in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (from pandasql) (2.0.1)
Requirement already satisfied: pandas in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (from pandasql) (2.3.1)
Requirement already satisfied: sqlalchemy in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (from pandasql) (2.0.43)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (from pandas->pandasql) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (from pandas->pandasql) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (from pandas->pandasql) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.17.0)
Requirement already satisfied: greenlet>=1 in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (from sqlalchemy->pandasql) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (from sqlalchemy->pandasql) (4.12.2)
Requirement already satisfied: duckdb in c:\users\pc\.conda\envs\decodeaienv\lib\site-packages (1.3.2)

In [18]:
#import required modules and packages

import numpy as np
import pandas as pd
from sklearn.datasets import load_iris
import sqlite3 as db

from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals()) # namespace

import duckdb

In [19]:
# Load Iris dataset
iris = load_iris()

In [20]:
iris.keys()

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [21]:
print(iris.DESCR)

.. _iris_dataset:

Iris plants dataset
--------------------

**Data Set Characteristics:**

:Number of Instances: 150 (50 in each of three classes)
:Number of Attributes: 4 numeric, predictive attributes and the class
:Attribute Information:
    - sepal length in cm
    - sepal width in cm
    - petal length in cm
    - petal width in cm
    - class:
            - Iris-Setosa
            - Iris-Versicolour
            - Iris-Virginica

:Summary Statistics:

============== ==== ==== ======= ===== ====================
                Min  Max   Mean    SD   Class Correlation
============== ==== ==== ======= ===== ====================
sepal length:   4.3  7.9   5.84   0.83    0.7826
sepal width:    2.0  4.4   3.05   0.43   -0.4194
petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)
petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)
============== ==== ==== ======= ===== ====================

:Missing Attribute Values: None
:Class Distribution: 33.3% for each of 3 classes.
:Creator: R.A. Fisher
:Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)
:Date: July, 1988

The famous Iris database, first used by Sir R.A. Fisher. The dataset is taken
from Fisher's paper. Note that it's the same as in R, but not as in the UCI
Machine Learning Repository, which has two wrong data points.

This is perhaps the best known database to be found in the
pattern recognition literature.  Fisher's paper is a classic in the field and
is referenced frequently to this day.  (See Duda & Hart, for example.)  The
data set contains 3 classes of 50 instances each, where each class refers to a
type of iris plant.  One class is linearly separable from the other 2; the
latter are NOT linearly separable from each other.

.. dropdown:: References

  - Fisher, R.A. "The use of multiple measurements in taxonomic problems"
    Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to
    Mathematical Statistics" (John Wiley, NY, 1950).
  - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.
    (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.
  - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System
    Structure and Classification Rule for Recognition in Partially Exposed
    Environments".  IEEE Transactions on Pattern Analysis and Machine
    Intelligence, Vol. PAMI-2, No. 1, 67-71.
  - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions
    on Information Theory, May 1972, 431-433.
  - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II
    conceptual clustering system finds 3 classes in the data.
  - Many, many more ...

In [22]:
df = pd.DataFrame(iris.data, columns=iris.feature_names)
df['species'] = pd.Categorical.from_codes(iris.target, iris.target_names)

df.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa

![Descriptive Alt Text](https://www.googleapis.com/download/storage/v1/b/kaggle-user-content/o/inbox%2F19517213%2F157356294f32ae95956a495960b7ea39%2F1_ZK9_HrpP_lhSzTq9xVJUQw.png?generation=1711814010788837&alt=media)

![Iris Flower Petal & Sepal Visualization](https://www.integratedots.com/wp-content/uploads/2019/06/iris_petal-sepal-e1560211020463.png)

In [23]:
df.shape

(150, 5)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
 4   species            150 non-null    category
dtypes: category(1), float64(4)
memory usage: 5.1 KB

In [25]:
df.columns = ['sepal_length','sepal_width','petal_length','petal_width','species']

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    category
dtypes: category(1), float64(4)
memory usage: 5.1 KB

**1. SELECT specific columns**

**P1. Select sepal length and species from the dataframe**

In [27]:
# using df built-ins
df[['sepal_length', 'species']].head()

   sepal_length species
0           5.1  setosa
1           4.9  setosa
2           4.7  setosa
3           4.6  setosa
4           5.0  setosa

In [28]:
# using pandasql
pysqldf("SELECT sepal_length, species FROM df LIMIT 5;").head()

   sepal_length species
0           5.1  setosa
1           4.9  setosa
2           4.7  setosa
3           4.6  setosa
4           5.0  setosa

In [29]:
# using duckdb
duckdb.query('SELECT sepal_length, species FROM df LIMIT 5;').to_df()

   sepal_length species
0           5.1  setosa
1           4.9  setosa
2           4.7  setosa
3           4.6  setosa
4           5.0  setosa

**2. WHERE/filtering**

**P2. Select rows where sepal length > 5**

In [30]:
# using df built-ins
df[df['sepal_length'] > 5.0].head()

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
10           5.4          3.7           1.5          0.2  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa

In [31]:
# using pandasql
pysqldf("SELECT * FROM df WHERE sepal_length > 5.0;").head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           5.4          3.9           1.7          0.4  setosa
2           5.4          3.7           1.5          0.2  setosa
3           5.8          4.0           1.2          0.2  setosa
4           5.7          4.4           1.5          0.4  setosa

In [32]:
# using duckdb
duckdb.query('SELECT * FROM df WHERE sepal_length > 5.0').to_df().head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           5.4          3.9           1.7          0.4  setosa
2           5.4          3.7           1.5          0.2  setosa
3           5.8          4.0           1.2          0.2  setosa
4           5.7          4.4           1.5          0.4  setosa

**3. ORDER BY**

**P3. Sort complete dataset into descending order based on sepal length**

In [33]:
# using df built-ins
df.sort_values(by='sepal_length', ascending=False).head()

     sepal_length  sepal_width  petal_length  petal_width    species
131           7.9          3.8           6.4          2.0  virginica
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica

In [34]:
# using pandasql
pysqldf("SELECT * FROM df ORDER BY sepal_length DESC LIMIT 5;")

   sepal_length  sepal_width  petal_length  petal_width    species
0           7.9          3.8           6.4          2.0  virginica
1           7.7          3.8           6.7          2.2  virginica
2           7.7          2.6           6.9          2.3  virginica
3           7.7          2.8           6.7          2.0  virginica
4           7.7          3.0           6.1          2.3  virginica

In [35]:
# using duckdb
duckdb.query('SELECT * FROM df ORDER BY sepal_length DESC LIMIT 5').to_df()

   sepal_length  sepal_width  petal_length  petal_width    species
0           7.9          3.8           6.4          2.0  virginica
1           7.7          2.6           6.9          2.3  virginica
2           7.7          3.8           6.7          2.2  virginica
3           7.7          2.8           6.7          2.0  virginica
4           7.7          3.0           6.1          2.3  virginica

**4. GROUP BY / aggregation**

**P4. Find average sepal length for each species of flowers**

In [36]:
# using df built-ins
df.groupby('species', observed=True)['sepal_length'].mean()

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

In [37]:
# using pandasql
pysqldf("SELECT species, AVG(sepal_length) as avg_sepal_length FROM df GROUP BY species;")

      species  avg_sepal_length
0      setosa             5.006
1  versicolor             5.936
2   virginica             6.588

In [38]:
# using duckdb
duckdb.query('SELECT species, AVG(sepal_length) as avg_sepal_length FROM df GROUP BY species').to_df()

      species  avg_sepal_length
0      setosa             5.006
1  versicolor             5.936
2   virginica             6.588

**5. JOIN (weâ€™ll create another small table for demonstration)**

In [39]:
# Small extra table
data = {
    'species': ['setosa', 'versicolor', 'virginica'],
    'color': ['red', 'blue', 'green']
}

species_info = pd.DataFrame(data)

In [40]:
species_info

      species  color
0      setosa    red
1  versicolor   blue
2   virginica  green

**P5. Join df and species_info**

In [41]:
# using df built-ins
df.merge(species_info, on='species', how='left').head()

   sepal_length  sepal_width  petal_length  petal_width species color
0           5.1          3.5           1.4          0.2  setosa   red
1           4.9          3.0           1.4          0.2  setosa   red
2           4.7          3.2           1.3          0.2  setosa   red
3           4.6          3.1           1.5          0.2  setosa   red
4           5.0          3.6           1.4          0.2  setosa   red

In [42]:
# using pandasql
pysqldf("SELECT df.*, species_info.color FROM df JOIN species_info ON df.species = species_info.species LIMIT 5;").head()

   sepal_length  sepal_width  petal_length  petal_width species color
0           5.1          3.5           1.4          0.2  setosa   red
1           4.9          3.0           1.4          0.2  setosa   red
2           4.7          3.2           1.3          0.2  setosa   red
3           4.6          3.1           1.5          0.2  setosa   red
4           5.0          3.6           1.4          0.2  setosa   red

In [43]:
# using duckdb
duckdb.query('''
    SELECT df.*, species_info.color 
    FROM df 
    JOIN species_info 
    ON df.species = species_info.species
    LIMIT 5
''').to_df()

   sepal_length  sepal_width  petal_length  petal_width species color
0           5.1          3.5           1.4          0.2  setosa   red
1           4.9          3.0           1.4          0.2  setosa   red
2           4.7          3.2           1.3          0.2  setosa   red
3           4.6          3.1           1.5          0.2  setosa   red
4           5.0          3.6           1.4          0.2  setosa   red

#### P6 - compute the mean, minimum and maximum values of sepal width feature and group by the species category

In [44]:
# the query to perform the above task would look like as below
q = """
       select
           species, 
           avg(sepal_width) as avg_sepal_width, 
           min(sepal_width) as min_sepal_width, 
           max(sepal_width) as max_sepal_width,
           from df
           group by species;
    """

duckdb.query(q).to_df()

      species  avg_sepal_width  min_sepal_width  max_sepal_width
0      setosa            3.428              2.3              4.4
1  versicolor            2.770              2.0              3.4
2   virginica            2.974              2.2              3.8

#### P7. create a new table using inner join on the iris df by creating two dummy tables a and b and join by species column

In [45]:
#let's create a new table using inner join on the iris df by creating two dummy tables a and b and join by species column
q = """
        select 
            a.* from 
            df a
            inner join
            df b
            on a.species = b.species
            limit 5;
    """

duckdb.query(q).to_df()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

#### P8. use a filter criteria to select some records where sepal_length*sepal_width > 25

In [47]:
# create one unique id column in iris df
df['id'] = range(len(df))
df.head()

   sepal_length  sepal_width  petal_length  petal_width species  id
0           5.1          3.5           1.4          0.2  setosa   0
1           4.9          3.0           1.4          0.2  setosa   1
2           4.7          3.2           1.3          0.2  setosa   2
3           4.6          3.1           1.5          0.2  setosa   3
4           5.0          3.6           1.4          0.2  setosa   4

In [48]:
# fetch the records where a logical condition is  using IN 

q = """
        select
            * from df
            where id in 
            
            (select id from df where sepal_width * sepal_length > 25);
    """

duckdb.query(q).to_df()

   sepal_length  sepal_width  petal_length  petal_width    species   id
0           5.7          4.4           1.5          0.4     setosa   15
1           7.2          3.6           6.1          2.5  virginica  109
2           7.7          3.8           6.7          2.2  virginica  117
3           7.9          3.8           6.4          2.0  virginica  131

---